[
    { 
        "pregunta":"Nombre los efectos de los contratos:",
        "respuesta":"Terceros, Sucesores Universales, Libertad de Contratacion, Efecto Vinculante, Buena Fe, Caracter de las normas legales, Imprevision, Clausula Expresa, Clausula Implicita"
    },
    { 
        "pregunta":"Explica el efecto de contratos: TERCEROS",
        "respuesta":"Los contratos no tienen efectos contra los terceros, no hace surgir obligaciones a cargo de terceros, ni los terceros tienen derecho a invocarlo"
    },
    { 
        "pregunta":"Explica el efecto de contratos: SUCESORES UNIVERSALES",
        "respuesta":"Los efectos del contrato se extienden activa y pasivamente a los sucesores universales, a no ser que las obligaciones que de él nacen sean inherentes a la persona,"
    },
    { 
        "pregunta":"Explica el efecto de contratos:  LIBERTAD DE CONTRATACION",
        "respuesta":"Las partes son libres para celebrar un contrato y delimitar su contenido, dentro de los límites impuestos por la ley, el orden público, la moral y las buenas costumbres."
    },
    { 
        "pregunta":"Explica el efecto de contratos: EFECTO VINCULANTE",
        "respuesta":"Todo contrato válidamente celebrado es obligatorio para las partes. Su contenido puede ser modificado o extinguido por acuerdo de partes o en los supuestos en que la ley lo prevé"
    },
    { 
        "pregunta":"Explica el efecto de contratos: BUENA FE",
        "respuesta":"el contrato no se limita a las obligaciones pactadas en el mismo, sino que se integra con todas las consecuencias secundarias y accesorias que resultan intrínsecas a la naturaleza del contrato"
    },
    { 
        "pregunta":"Explica el efecto de contratos: CARÁCTER DE LAS NORMAS LEGALES",
        "respuesta":"Las normas legales relativas a los contratos son supletorias de la voluntad de las partes, a menos que de su modo de expresión, de su contenido, o de su contexto, resulte su carácter indisponible"
    },
    { 
        "pregunta":"Explica el efecto de contratos: IMPREVISION",
        "respuesta":"Si en un cotnrato conmutativo la prestacion a cargo de unas de las partes se torna excesivamente onerosa, la otra parte tiene derecho a plantear la resolucion total o parcial del contrato o su adecuacion."
    },
    { 
        "pregunta":"Explica el efecto de contratos: CLAUSULA RESOLUTORIA EXPRESA",
        "respuesta":"Las partes pueden pactar expresamente que la resolución se produzca en caso de incumplimientos genéricos o específicos debidamente identificados."
    },
    { 
        "pregunta":"Nombre los derechos reales sobre cosa propia",
        "respuesta":"Dominio, Condominio, Propiedad Horizontal, Conjuntos inmboliarios, Tiempo compartido, cementerio privado, superficie"
    },
    { 
        "pregunta":"Nombre los derechos reales sobre cosa ajena",
        "respuesta":"Usufructo, Uso, Habitacion, Servidumbre, Hipoteca, Anticresis, Prenda"
    },
    { 
        "pregunta":"Nombre las posibles extinciones de los contratos",
        "respuesta":"Pago, Pago por compensación, Pago por subrogación, Pago por consignaciones, Pago por confusión, Pago por novación, Pago por transacción, Pago por renuncia, Pago por remisión de deuda, Pago por imposibilidad de cumplimiento, Pago por prescripción."
    },
    { 
        "pregunta":"Explica Pago por compensacion",
        "respuesta":"cuando dos personas reúnan la calidad de deudor y acreedor recíprocamente, extinguiéndose ambas deudas hasta donde alcance la menor quedando subsistente una sola por la diferencia"
    },
    { 
        "pregunta":"Explica Pago por subrogación",
        "respuesta":"cuando el pago de la obligación lo realiza un tercero y no el deudor, a partir de ese momento el tercero tiene todos los derechos y obligaciones y garantías que el primitivo deudor"
    },
    { 
        "pregunta":"Pago por consignaciones",
        "respuesta":"el depósito judicial ya que el deudor no solo tiene la obligación de pagar si no además el derecho a desobligarse"
    },
    { 
        "pregunta":"Pago por confusión",
        "respuesta":"cuando concurran en la misma persona la calidad de deudor y acreedor de la obligación "
    },
    { 
        "pregunta":"Pago por novación",
        "respuesta":"cuando acreedor y deudor dan por extinguida una obligación pendiente y convienen en sustituirla por una nueva. La obligación antigua es la causa de la nueva prestación. "
    },
    { 
        "pregunta":"Pago por transacción",
        "respuesta":"el acto por el cual las partes haciéndose concesiones reciprocas ponen fin a obligaciones que son dudosas o litigiosas"
    },
    { 
        "pregunta":"Nombre las funciones de la responsabilidad civil",
        "respuesta":"Preventiva, Resarcible, Sancionatoria"
    },
    { 
        "pregunta":"Que comprende la indemnizacion en daño resarcible?",
        "respuesta":"Perdida de patrimonio, lucro cesante, perdida de chance"
    },
    { 
        "pregunta":"Que es el lucro cesante?",
        "respuesta":"lucro cesante es la frustración de un enriquecimiento legítimo que debe demostrarse con pautas objetivas y ciertas que se podía obtener"
    },
    { 
        "pregunta":"Que es el enriquecimiento sin causa?",
        "respuesta":"toda persona sin una causa licita se enriquezca a expensa de otro, está obligada en la medida de su beneficio, a resarcir el detrimento patrimonial del empobrecido"
    },
    { 
        "pregunta":"Nombre las fuentes de obligacion a voluntad",
        "respuesta":"Contrato, Titulo Valores, Voluntad Unilateral"
    },
    { 
        "pregunta":"Nombre las fuentes de obligacion de ley",
        "respuesta":"Cuasi-Contrato, Abuso edl derecho, Enriquecimiento sin causa, Responsabilidad civil."
    },
    { 
        "pregunta":"Que es la condicion de un acto juridico?",
        "respuesta":"cláusula de los actos jurídicos por la cual las partes subo"
    },
    { 
        "pregunta":"Que es el plazo de un acto juridico?",
        "respuesta":"Es la cláusula por la cual la exigibilidad o la extinción de un acto jurídico pueden quedar diferidas al vencimiento de un plazo"
    },
    { 
        "pregunta":"Que es el cargo de un acto juridico?",
        "respuesta":"Obligacion a la que va unida una liberalidad."
    },
    { 
        "pregunta":"Que son las cosas fungibles?",
        "respuesta":"Son aquellas en que todo individuo de la especie equivale a otro de la misma especie y pueden sustituirse."
    },
    { 
        "pregunta":"Que son las cosas accesorias?",
        "respuesta":"La existencia y naturaleza son determinadas por otra cosa de la cual dependen o a la cual están adheridas."
    },
    { 
        "pregunta":"Que son las cosas muebles?",
        "respuesta":"Son las que pueden desplazarse por sí mismas o por una fuerza extraña."
    },
    { 
        "pregunta":"Que son las cosas inmuebles por su accesion?",
        "respuesta":"Son las que se encuentran inmovilizadas por su adhesión física al suelo, es decir formando un todo inseparable con el suelo,"
    },
    { 
        "pregunta":"Que son los contratos onerosos?",
        "respuesta":"Son a título oneroso cuando las ventajas que procuran a una de las partes les son concedidas por una prestación que ella ha hecho o se obliga a la otra."
    },
    { 
        "pregunta":"Que son los contratos gratuitos?",
        "respuesta":"Son a título gratuito cuando aseguran a uno o a otro de los contratantes alguna ventaja independiente de toda prestación a su cargo"
    },
    { 
        "pregunta":"Que son los contratos Conmutativos?",
        "respuesta":" Los contratos a título oneroso son conmutativos cuando los derechos y obligaciones que asumen todos los contratantes son ciertos."
    },
    { 
        "pregunta":"Nombre los elementos escensiales de los contratos",
        "respuesta":"consentimiento, capacidad, objeto, causa, y forma"
    }
]